Show / Hide Table of Contents
Class ConnectionResultsData
Results for all connections in project
Inheritance
System.Object
ConnectionResultsData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class ConnectionResultsData
Constructors
Improve this Doc   View Source
ConnectionResultsData()
Constructor
Declaration
public ConnectionResultsData()
Properties
Improve this Doc   View Source
ConnectionCheckRes
List of ConnectionCheckRes
Declaration
[DataMember]
public List<ConnectionCheckRes> ConnectionCheckRes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConnectionCheckRes>
 Improve this Doc
 View Source